import 'package:flutter/material.dart';
import '../../../../../constants.dart';

class PlanningDetailsScreen extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: kPrimaryColor, // استخدام اللون المخصص
        leading: IconButton(
          icon: Icon(Icons.arrow_back, color: Colors.white), // السهم باللون الأبيض
          onPressed: () {
            Navigator.pop(context); // العودة إلى الصفحة السابقة
          },
        ),
        title: Container(
          alignment: Alignment.centerRight, // محاذاة النص إلى اليمين
          child: Text(
            'معلومات أكثر عن التحقق والتخطيط',
            style: TextStyle(color: Colors.white),
            textAlign: TextAlign.right, // محاذاة النص داخل الحاوية
          ),
        ),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.end, // لتوجيه النص إلى اليمين
            children: [
              // Step 4
              Text(
                'الخطوة 4: التحقق من صحة الفكرة',
                style: TextStyle(
                  fontSize: 24,
                  fontWeight: FontWeight.bold,
                  color: kPrimaryColor,
                ),
                textAlign: TextAlign.right, // توجيه العنوان إلى اليمين
              ),
              SizedBox(height: 10),
              Text(
                'بعد "كيفية إنشاء شركة ناشئة؟" يأتي السؤال الكبير التالي، "هل يريد الناس شراء فكرتي؟" إن التحقق من صحة فكرة الشركة الناشئة يعني التحقق مما إذا كان هناك طلب حقيقي على منتجك أو خدمتك وتحديد المبلغ الذي يرغب المستهلكون في دفعه.\n\n'
                    ': إليك كيفية القيام بذلك\n\n'
                    '  تشكيل فرضيات أساسية حول من هم عملاؤك المستهدفون، والمشكلات التي يواجهونها، وكيف يمكن لمنتجك أو خدمتك حل هذه المشكلات * \n'
                    ' اجمع المعلومات الداعمة, استخدم التقارير والدراسات الصناعية لدعم فرضياتك، وفكر في إجراء استطلاعات الرأي والمقابلات ومجموعات التركيز مع جمهورك المستهدف. سيساعدك هذا * \n في جمع معلومات مباشرة حول احتياجاتهم وسلوكياتهم ',
                textAlign: TextAlign.right, // توجيه النص إلى اليمين
                style: TextStyle(fontSize: 18),
              ),
              SizedBox(height: 20),

              // Step 5
              Text(
                'الخطوة 5: إنشاء خطة عمل',
                style: TextStyle(
                  fontSize: 24,
                  fontWeight: FontWeight.bold,
                  color: kPrimaryColor,
                ),
                textAlign: TextAlign.right, // توجيه العنوان إلى اليمين
              ),
              SizedBox(height: 10),
              Text(
                'تساعدك خطة العمل الرسمية على تصور كيفية بناء شركة ناشئة ورسم خريطة لنموها المستقبلي. كما ستساعدك على البقاء على تواصل مع فريقك ومستثمريك، وفهم جدوى نموذج عملك والتخفيف من المخاطر.\n\n'
                    '  : وفيما يلي النقاط الرئيسية التي يجب تضمينها في خطة عملك\n\n '
                    ' **حدد سوقك المستهدف**\n'
                    '   اعرف من هم عملاؤك، وما هي احتياجاتهم، وكيف يمكنك تلبيتها. هذا سيساعدك في توجيه جهود التسويق بشكل أفضل\n\n'
                    ' **قم بتحليل المنافسين**\n'
                    '   افهم من هم منافسوك، وما هي استراتيجياتهم، وكيف يمكنك التميز عنهم. هذا سيساعدك في تحديد الفرص والتحديات\n\n'
                    ' **أنشئ ملفات تعريف أو شخصيات للعملاء المستهدفين**\n'
                    '   قم بتطوير شخصيات تمثل عملاءك المثاليين، مع تفاصيل عن اهتماماتهم وسلوكياتهم. سيساعدك هذا في تخصيص رسالتك التسويقية\n\n'
                    ' **قم بتوضيح عرض البيع الفريد الخاص بك **\n'
                    '   حدد ما يجعل منتجاتك أو خدماتك مميزة. هذا هو السبب الذي يجعل العملاء يختارونك على المنافسين\n\n'
                    ' **قم بصياغة رسالتك**\n'
                    '   اجعل رسالتك واضحة وموجزة، موضحًا فوائد منتجاتك أو خدماتك للعملاء. يجب أن تجيب على سؤال "لماذا يجب أن أشتري منك؟"\n\n'
                    '**حدد الأهداف**\n'
                    '   ضع أهدافًا قصيرة وطويلة المدى. يجب أن تكون هذه الأهداف محددة وقابلة للقياس، مما يساعد على تقييم تقدمك وتحقيق النجاح',
                textAlign: TextAlign.right, // توجيه النص إلى اليمين
                style: TextStyle(fontSize: 18),
              ),
              SizedBox(height: 20),

              // Step 6
              Text(
                'الخطوة 6: سجل عملك',
                style: TextStyle(
                  fontSize: 24,
                  fontWeight: FontWeight.bold,
                  color: kPrimaryColor,
                ),
                textAlign: TextAlign.right, // توجيه العنوان إلى اليمين
              ),
              SizedBox(height: 10),

              Text(
                'إن تسجيل شركتك الناشئة يعد خطوة بالغة الأهمية لتحويل عملك إلى كيان قانوني. إليك ما ينطوي عليه تسجيل شركة ناشئة عادةً:\n\n'
                    ' **اختيار اسم لشركتك الناشئة**\n'
                    '   اختر اسمًا فريدًا وسهل التذكر، ويعكس طبيعة عملك. يجب التأكد من أن الاسم غير مستخدم من قبل وأنه متاح للتسجيل\n\n'
                    ' **الحصول على رقم تعريف صاحب العمل (EIN)**\n'
                    '   يعتبر رقم EIN ضروريًا لأغراض الضرائب، وهو مطلوب لتوظيف الموظفين وفتح حسابات مصرفية تجارية. يمكنك الحصول عليه بسهولة من إدارة الضرائب\n\n'
                    ' **تسجيل عملك لدى الدولة**\n'
                    '   يجب عليك تسجيل عملك ككيان قانوني في ولايتك. قد يتطلب ذلك ملء استمارات معينة ودفع رسوم تسجيل\n\n'
                    ' **فتح حساب بنكي تجاري**\n'
                    '   من المهم فصل أموالك الشخصية عن أموالك التجارية. سيساعدك فتح حساب بنكي تجاري في إدارة أموالك بشكل أفضل وتسهيل العمليات المالية\n\n'
                    ' **تأمين التأمين**\n'
                    '   يعتبر التأمين جزءًا أساسيًا من حماية عملك. يجب عليك البحث عن أنواع التأمين المناسبة، مثل التأمين ضد المسؤولية، وتأمين الممتلكات، وتأمين العمال\n',
                textAlign: TextAlign.right, // توجيه النص إلى اليمين
                style: TextStyle(fontSize: 18),
              ),
              SizedBox(height: 100),

            ],
          ),
        ),
      ),
    );
  }
}